import asyncio
from pyperclip import copy
from sydney import SydneyClient

f = open("token.txt", "r")
bing_cookie_pre = f.read()
f.close()
bing_cookie = ""
if bing_cookie_pre != "":
    bing_cookie = bing_cookie_pre
else:
    bing_cookie = input("Paste your cookie here: ")
    f = open("token.txt", "a")
    f.write(bing_cookie)
    f.close()

async def main() -> None:
    async with SydneyClient(bing_u_cookie=bing_cookie) as sydney:
        while True:
            name = input("Name of that movie: ")
            if name == "end":
                break
            prompt = ("""Напиши допис про фільм """ + name + """ по цьому шаблону:
{назва фільму/серіалу}(виділити жирним шрифтом)
                      
{країна} | {рік} | {жанри} | {тривалість} | вік {вік} (виділити увесь написаний перед цим текст жирним шрифтом)

Короткий зміст (виділити жирним шрифтом)

Тут короткий зміст фільму, на початку ставимо емоджі, що пов'язане з кожним фактом (без пробілу біля емоджі), не забуваємо про пунктуацію, великі букви тощо.

Цікаві факти

🤖| Факт 1: {факт номер 1} (пілся факту відійти рядок до наступного)

🧐| Факт 2:{факт номер 2} (пілся факту відійти рядок до наступного)

🎭| Факт 3: {факт номер 3}

Трейлер🍿: {силка з ютуб офіційоного трейлера,  посилання не зашифровувати у буквах, а прсто статичне. Написати інтернет посилання таким яким воно і є}

==========

Матеріали для допису взято з: посилання на всі джерела через кому, Написати інтернет посилання таким яким воно є

#вік #жанр #тип #сімейні(якщо сімейний фільм, якщо фільм НЕ сімейний – не писати цей тег узагалі)

====================

Усі теги пишуться з маленької літери
Тип – фільм/мультфільм/серіал
Жанр – комедія, драма, кримінал тощо
Вік писати так: #вік0, якщо вікова категорія 0+ тощо""")

            print("Bing AI: ", end="", flush=True)
            response = str(await sydney.ask(prompt=prompt))
            print(response)
            print("\n")
            copy(response)
            print("Ваш допис був скопійований в кліпборд, і ви можете його вставляти в чат!")
            


if __name__ == "__main__":
    asyncio.run(main())